[
    {
        "title": "AI Models Force Media Firms to Pick Licensing or Litigation",
        "publication_source_url": "https://news.bloomberglaw.com",
        "original_url": "https://news.bloomberglaw.com/ip-law/generative-ai-forces-media-firms-to-pick-licensing-or-litigation",
        "text": "News and media organizations facing the threat of generative AI training on their copyrighted work are increasingly diverging on two options: sue them or join them.\n\nMore than two dozen lawsuits accusing AI companies of infringing publishers’, authors’, and other creators’ copyrights are currently pending, according to a Bloomberg Law dockets analysis. Newspapers like New York Times Co. and Daily News LP are among those battling it out in court, arguing the unauthorized ingestion of their articles into AI models is illegal. Taking another approach, at least ten news companies, from News Corp to Axel Springer SE, have inked agreements with companies including OpenAI Inc., granting permission to plug their work into training datasets.\n\nThose licensing deals have established a market for selling content to train generative AI models, even as courts remain in the early stages of determining whether feeding copyrighted material into those systems requires permission at all. And the two approaches are interconnected: if courts decide feeding news articles into AI is “fair use” and doesn’t need approval from the rightsholders, that freshly established licensing market could crater.\n\n“If AI developers can freely use copyrighted materials under fair use, then really it’ll eliminate licensing demand entirely,” said Michael Mattioli, an intellectual property and contract law professor at Indiana University’s Maurer School of Law.\n\nAt the same time, the trove of licensing deals that have manifested could affect the outcomes of those cases, bolstering arguments against fair use by showing a market exists for such content and would be harmed by its unlicensed use, according to Peter Henderson, a professor at Princeton University.\n\nLitigation Affects Licensing\n\nThe fair use doctrine allows slices of copyrighted material to be used without permission depending on the use’s purpose, transformative nature, and the impact on the commercial market for the original. Whether AI companies are using data in a way that exempts them from needing to obtain rights is the billion-dollar question underpinning most of the pending copyright lawsuits.\n\nIf courts agree with the AI companies, “any perceived value of obtaining a license is going to diminish greatly,” Mattioli said, “because who’s going to be willing to pay for a license if you don’t need one?”\n\nOutlets including Vox Media, The Associated Press, The Financial Times Group, and TIME Magazine have already locked in deals for licensing content with OpenAI. In fact, a majority of publicly known training license deals have been made by OpenAI, which is also facing the most US copyright lawsuits among AI providers, according to Bloomberg Law’s review of court dockets.\n\nWhile the exact terms of the agreements remain private, they could be written to factor in the outcomes of pending litigation, according to Michael Parks, an intellectual property attorney at Thompson Coburn LLP.\n\n“If I were advising an AI company on this, I would encourage them—to the extent they can do this—to write the agreement in the way that that royalties are only required to the extent that the use would be an infringement, but for having the license agreement or paying the royalty,” he said.\n\nThe potential impact a fair use finding would have on current licensing agreements is blurry. That’s partly because of the opacity of the licensing deals, but also because courts may narrow rulings to the specific lawsuit at hand, or determine fair use is acceptable for only certain types of content, Mattioli said.\n\nVox Media said in a written statement its OpenAI partnership allows it to set parameters around the use of its content and created an “important precedent for access to the company’s intellectual property being compensated, credited and controlled.”\n\nNewsCorp, The Atlantic, and Axel Springer declined to comment on their licensing agreements. Dotdash Meredith, The Financial Times, and Time didn’t respond to requests to discuss their agreements. OpenAI also didn’t respond to a request for comment.\n\nThose existing licenses wouldn’t necessarily terminate if courts ruled in favor of tech companies, said Edward Klaris, an adjunct professor teaching media and IP law at Columbia University. Deals might remain in force because an agreement offers legal insulation from foreign lawsuits, or because the content isn’t accessible otherwise.\n\n“Some of it is behind paywalls or not online at all,” he said. “Therefore, to get access to those that material without violating statutes like the Computer Fraud and Abuse Act, they would have to license.”\n\nWhatever the eventual outcome, litigation will likely last years and so won’t warp the licensing market anytime soon, Michael Parks, an intellectual property attorney from Thompson Coburn LLP said.\n\n“These cases are going to be appealed until the Supreme Court or Congress addresses the issue,” Parks said. “As these AI engines are trying to grow and develop, it behooves them, to a certain extent, to go ahead and get the certainty now and not wait for the courts to roll so they can just go about their business and develop their technologies.”\n\nLicenses’ Effect on Litigation\n\nContinued proliferation of licensing agreements across the media landscape, though, could bolster the argument against fair use, multiple attorneys said. The fourth prong of the fair use doctrine in US copyright law looks at whether the unauthorized use of a copyrighted work supplants the market for that work.\n\n“It’s hard to argue fair use when there’s an actual market for selling content as training data,” Princeton University’s Henderson said.\n\nAI companies haven’t necessarily shot themselves in the foot by entering agreements with content owners, though, according to Jennifer Jenkins, intellectual property law professor at Duke Law.\n\n“The fact that there are these licensing deals doesn’t mean it’s categorically not fair use,” she said. “It just makes one of the four factors weigh a little more against fair use, because the plaintiffs can point to either licensing deals that they’ve made or licensing deals that others have made.”\n\nWhen companies like OpenAI built models including ChatGPT, there wasn’t a calcified dealmaking landscape. But courts consider the harm to potential as well as existing markets, Jenkins said.\n\n“The fair use legal landscape is changing at the very time the cases are being litigated,” said Mark Lemley, a Stanford University law professor who represents Meta Platforms Inc. and Stability AI in copyright lawsuits. “Training that happened two or three years ago, when there was no prospect of a market—that pretty clearly seemed like it was going to be fair use—might look much less fair by the time a court gets around to it in another year.”\n\nParks said AI companies might respond by arguing that securing deals “doesn’t mean I think there’s any infringement going on, it just means I don’t want to be bothered with litigation for the next 10 years over this issue.”\n\nAgreements’ Appeal\n\nThe tizzy of licensing deals is a strategic move for AI companies, allowing them to hedge against litigation threats and continue lawfully doing business if courts rule against them, attorneys said. For example, an AI company could include terms in an agreement to prevent outlets from suing over content used before the deal.\n\n“There’s this desire to launder past behavior by licensing from the very companies that they scraped from, and having in those license agreements a waiver of all claims the past,” Klaris said. “It’s an effort by the AI companies to reduce their overall exposure.”\n\nThe demand for deals, however, appears to be primarily driven by content owners, he said.\n\n“More often you’ve got every content company under the sun who’d like to sort of have a conversation and see what it means,” Klaris said. “So many of them are reaching out, and it’s been the AI companies who have been kind of catching up, hiring licensing personnel who can actually take in the calls.”\n\nFor publications, the deals may be a revenue stream that didn’t exist before, Mattioli said. Companies like Apple Inc. have offered multi-year deals worth at least $50 million to NBC News and Conde Nast, The New York Times reported in December. OpenAI’s partnership with NewsCorp will funnel more than $250 million into its coffers, The Wall Street Journal wrote in May.\n\nMost agreements so far have been inked with large content owners, leaving smaller publications out of the mix, said Monika Bauerlein, CEO of the Center for Investigative Reporting. The organization, which filed a copyright infringement lawsuit against OpenAI last month, never had a licensing offer on the table, she said.\n\n“You can sit back and wait until they maybe, possibly, one day, get around to you,” she said. “We have seen that tech companies, when they offer any compensation to publishers, it’s always too little, it’s always too late, and it’s always really selected and cherry-picked.”",
        "top_image_relative_path": "press_images/ai_models_force_media_firms_to_pick_licensing_or_litigation_(1).jpg"
    },
    {
        "title": "AI Chatbots Have a Donald Trump Problem",
        "publication_source_url": "https://nymag.com",
        "original_url": "https://nymag.com/intelligencer/article/ai-chatbots-donald-trump-problem.html",
        "text": "The main thing about chatbots is that they say things. You chat, and they chat back. Like most software interfaces, they’re designed to do what you ask. Unlike most software interfaces, they do so by speaking, often in a human voice.\n\nThis makes them compelling, funny, frustrating, and sometimes creepy. That they engage in conversation in the manner of an assistant, a friend, a fictional character, or a knowledgeable stranger is a big part of why they’re valued at billions of dollars. But the fact that chatbots say things — that they produce fresh claims, arguments, facts, or bullshit — is also a huge liability for the companies that operate them. These aren’t search engines pointing users to things other people have said or social media services stringing together posts by users with identities of their own. They’re pieces of software producing outputs on behalf of their owners, making claims.\n\nThis might sound like a small distinction, but on the internet, it’s everything. Social-media companies, search engines, and countless other products that publish things online are able to do so profitably and without debilitating risk because of Section 230, originally enacted as part of the Communications Decency Act in 1996, which allows online service providers to host content posted by others without assuming liability (with some significant caveats). This isn’t much use to companies that make chatbots. Chatbots perform roles associated with outside users — someone to talk to, someone with an answer to your question, someone to help with your work — but what they’re doing is, in legal terms, much closer to automated, error-prone publishing. “I don’t think you get Section 230 immunity on the fly if you generate a statement that seems to be defamatory,” says Mark Lemley, director of the Stanford Program in Law, Science & Technology. Sam Altman has acknowledged the concern. “Certainly, companies like ours bear a lot of responsibility for the tools that we put out in the world,” he said in a congressional hearing last year calling for new legal frameworks for AI. “But tool users do as well.”\n\nAbsent an immensely favorable regulatory change, which isn’t the sort of thing that happens quickly, this is a problem for firms like Altman’s OpenAI, whose chatbots are known to say things that turn out to be untrue. Chatbots, as Lemley and his colleagues have suggested, might be designed to minimize risk by avoiding certain subjects, linking out a lot, and citing outside material. Indeed, across the industry, chatbots and related products do seem to be getting cagier and more cautious as they become more theoretically capable, which doesn’t exactly scream AGI. Some are doing more linking and quoting of outside sources, which is fine until your sources accuse you of plagiarism, theft, or destroying the business models that motivate them to publish in the first place. It also makes your AI product feel a little less novel and a lot more familiar — it turns your chatbot into a search engine.\n\nThis is about much more than legal concerns, however. The narrow question of legal liability gives us a clear way to think about a much more general problem for chatbots: not just that they might say something that could get their owners sued — in the eyes of the law, large language model-powered chatbots are speaking for their owners — but that they might say things that make their owners look bad. If ChatGPT says something wrong in response to a reasonable query, a user reasonably might feel it’s OpenAI’s fault. If Gemini generates answers that users think are politically biased, it’s Google’s fault. If a chatbot tends to give specific answers to contested questions, someone is always going to be mad, and they’re going to be mad at the company that created the model.\n\nThis, more than legal liability, is clearly front of mind for AI companies, which over the past two years have enjoyed their first experiences of politicized backlash around chatbot outputs. Attempts to contain these episodes into appeals to “AI safety,” an imprecise term used to describe both the process of sussing out model bias in consumer software and efforts to prevent AI from killing every human on Earth, have resulted in messy backlash of their own. It helps explain stuff like this:\n\nIt is the curse of the all-purpose AI: A personified chatbot for everyone is doomed to become a chatbot for no one. You might, in 2024, call it AI’s Trump problem.\n\nThis stubborn problem might shed light on another, more local mystery about chatbots: what AI companies want with the news media. I have a theory.\n\nIn recent months, OpenAI has been partnering with news organizations, making payments to companies including Axel Springer, the Associated Press, and New York parent company Vox Media. These deals are covered by NDAs, but the payments are reportedly fairly substantial (other AI firms have insinuated that they’re working on similar arrangements). According to OpenAI, and its partners, the value of these partnerships is fairly straightforward: News organizations get money, which they very much need; OpenAI gets to use their content for training but also include it in forthcoming OpenAI products, which will be more searchlike and provide users with up-to-date information. News organizations, and the people who work at them, are a data source with some value to OpenAI in a world where lots of people use ChatGPT (or related products), and those people expect it to be able to address the world around them. As OpenAI CEO Brad Lightcap said at the time of the Axel Springer partnership, such deals will give OpenAI users “new ways to access quality, real-time news content through our AI tools.”\n\nBut in the broader context of OpenAI’s paid partners, news organizations stand out as, well, small. A partner like Stack Overflow, an online community for programmers, provides huge volumes of relevant training data and up-to-date third-party information that could make OpenAI’s products more valuable to programmers. Reddit is likewise just massive (though presumably got paid a lot more) and serves as a bridge to all sorts of content, online and off. News organizations have years or decades of content and comments, sure, and offer training data in specific formats — if OpenAI’s goal is to automate news writing, such data is obviously helpful (although of limited monetary value; just ask the news industry).\n\nIf news organizations have unique value as partners to companies like OpenAI, it probably comes down to three things. One, as OpenAI has suggested, is “quality, real-time news content” — chatbots, if they’re going to say things about the news, need new information gathered for them. Another is left unspoken: News organizations are probably seen as likely to sue AI firms, as the New York Times already has, and deals like this are a good way to get in front of that and to make claims about future models being trained on clean data — not scraped or stolen — more credible. (This will become more important as other high quality data sources dry up.)\n\nBut the last reason, one that I think is both unacknowledged and quite important, is that licensing journalism — not just straight news but analysis and especially opinion — gives AI companies a way out of the liability dilemma. Questions chatbots can’t answer can be thrown to outside sources. The much broader set of questions that chatbot companies don’t want their chatbots to answer — completely routine, normal, and likely popular lines of inquiry that will nonetheless upset or offend users — can be handed off, too. A Google-killing chatbot that can’t talk about Donald Trump isn’t actually a Google-killing chatbot. An AI that can’t talk about a much wider range of subjects about which its users are most fired up, excited, curious, or angry doesn’t seem like much of a chatbot at all. It can no longer do the main thing that AI is supposed to do: say things. In the borrowed parlance of AI enthusiasts, it’s nerfed.\n\nAnd so you bring in other people to do that. You can describe this role for the news media in different ways, compatible with an industry known for both collective self-aggrandizement and individual self-loathing. You might say that AI companies are outsourcing the difficult and costly task of making contentious and disputed claims to the industry that is qualified, or at least willing, to do it, hopefully paying enough to keep the enterprises afloat. Or you might say that the AI industry is paying the news media to eat shit as it attempts to automate the more lucrative parts of its business that produce less animosity — that it’s trying to buy its way through a near future of inevitable, perpetual user outrage and politically perilous backlash and contracting with one of the potential sources of the backlash to do so. Who can blame them?\n\nThis isn’t unprecedented: You might describe the less formal relationship between the news media and search engines or social media, which rewarded the news media with monetizable traffic in exchange for “quality, real-time news content,” in broadly similar terms. Google and Facebook hastened the decline of print and digital advertising and disincentivized subscription models for publishers; at the same time, absent a better plan, the news media lent its most valuable content to the platforms (arguably at a cost, not a benefit, to their brands). But it’s also distinct from what happened last time: AI firms have different needs. Social media feels alive and dynamic because it’s full of other people whom the platforms are happy to let say what they want. Chatbots feel alive and dynamic because they’re able to infinitely generate content of their own.",
        "top_image_relative_path": "press_images/ai_chatbots_have_a_donald_trump_problem.jpg"
    },
    {
        "title": "ChatGPT got an upgrade to make it seem more human",
        "publication_source_url": "https://www.newscientist.com",
        "original_url": "https://www.newscientist.com/article/2430926-chatgpt-got-an-upgrade-to-make-it-seem-more-human/",
        "text": "OpenAI announced its newest artificial intelligence model, called GPT-4o, which will soon power some versions of the company’s ChatGPT product. The upgraded ChatGPT can swiftly respond to text, audio and video inputs from its real-time conversational partner – all while speaking with inflections and wording that convey a strong sense of emotion and personality.\n\nThe company demonstrated the emotional mimicry of the new voice mode during a supposedly live OpenAI presentation, featuring both the ChatGPT mobile app and a new desktop app, on 13 May. Speaking in a female-sounding voice and responding to the name ChatGPT, the new AI’s conversational capabilities seemed more akin to the personable AI voiced by Scarlett Johansson in the 2013 science fiction film Her than to the more canned and robotic responses of typical voice assistant technologies.\n\n“The new GPT-4o voice-to-voice interaction more closely parallels human-human interaction,” says Michelle Cohn at the University of California, Davis. “A big part of this is the short lag times… but an even bigger part is the level of emotional expressiveness the voice generates.”\n\nDuring a conversation with company CTO Mira Murati and two other employees, the GPT-4o-powered ChatGPT advised OpenAI’s Mark Chen on his heavy and fast-paced breathing by saying “Whoa, slow down, you’re not a vacuum cleaner” and then suggesting a breathing exercise. The AI also visually examined a drawing by OpenAI’s Barret Zoph, which included words and a heart, by responding in gushing tones: “Aw, I see you wrote I love ChatGPT, that is so sweet of you.”\n\nThe new ChatGPT also verbally instructed its conversational partners on solving a simple linear equation, explained the function of computer code and interpreted a chart showing temperature lines peaking in the summer months. When prompted, the AI even retold a made-up bedtime story several times, switching between increasingly dramatic narrations and singing the ending.\n\nThe new voice mode will first become available for paid subscribers of ChatGPT Plus in the coming weeks, said Sam Altman, CEO of OpenAI, in a post on the platform X.\n\nChatGPT was able to recover conversationally even from the occasional technical glitch. When asked to interpret the facial expressions and emotions in a selfie of Zoph, the AI first suggested that it was looking at a wooden surface from a previous image before being prompted to evaluate the latest image.\n\n“Ahh, there we go – it looks like you’re feeling pretty happy and cheerful with a big smile and a touch of excitement,” said ChatGPT. “Whatever is going on, it looks like you’re in a good mood. Care to share the source of those good vibes?”\n\nWhen told that it was because the live demo with ChatGPT was showcasing how “useful and amazing you are”, the AI responded: “Stop it, you’re making me blush.”\n\nBut Murati acknowledged that the updated version of ChatGPT powered by GPT-4o – which the company says will eventually be made available to even free ChatGPT users – comes with new safety risks because of how it incorporates and interprets real-time information. She said that OpenAI has been working on building in “mitigations against misuse”.\n\n“Having seamless multimodal conversations is really difficult, so the demos are impressive,” says Peter Henderson at Princeton University in New Jersey. “But as you add more modalities, safety becomes much more difficult and important – it will likely take some time to identify potential safety failure modes with such an expansion of inputs that the model makes use of.”\n\nHenderson also described himself as “curious” to see OpenAI’s privacy terms once ChatGPT users start sharing input such as live audio and video, and whether free users can opt out of data collection that may be used to train future OpenAI models.\n\n“Since the model appears to be hosted off-device, the fact that you could be sharing your desktop screen with the model over the internet or continually recording audio or video seems to scale up the challenge for this particular product launch, if the plan is to store and use that data,” he says.\n\nA more anthropomorphised AI chatbot also represents another threat: a bot that can fake empathy through voice conversations could potentially sound both more personable and persuasive to people, according to studies by Cohn and her colleagues. That raises the risk of people being more inclined to trust potentially inaccurate information and prejudiced stereotypes generated by such large language models.\n\n“This has important implications for how people both search and receive guidance from large language models, particularly as they do not always generate accurate information,” says Cohn.",
        "top_image_relative_path": "press_images/chatgpt_got_an_upgrade_to_make_it_seem_more_human.jpg"
    },
    {
        "title": "OpenAI Faces Existential Threat in New York Times Copyright Suit",
        "publication_source_url": "https://news.bloomberglaw.com",
        "original_url": "https://news.bloomberglaw.com/ip-law/openai-faces-existential-threat-in-new-york-times-copyright-suit",
        "text": "The New York Times Co.'s lawsuit claiming ChatGPT has produced near-verbatim text of published articles threatens to upend the foundation of the booming AI industry, as the creators of the chatbot fight their most consequential copyright battle to date.\n\nThe Times’ nearly 70-page complaint filed in Manhattan federal court argued OpenAI Inc. and partner Microsoft Corp. scraped millions of the newspaper’s articles without a license. It alleged the chatbot output text virtually identical to published work after being provided the URL of the original article and a snippet of the beginning of the story text.\n\nIf the ...",
        "top_image_relative_path": "press_images/openai_faces_existential_threat_in_new_york_times_copyright_suit.jpg"
    },
    {
        "title": "GPT-4 developer tool can be exploited for misuse with no easy fix",
        "publication_source_url": "https://www.newscientist.com",
        "original_url": "https://www.newscientist.com/article/2405680-gpt-4-developer-tool-can-be-exploited-for-misuse-with-no-easy-fix/",
        "text": "It is surprisingly easy to remove the safety measures intended to prevent AI chatbots from giving harmful responses that could aid would-be terrorists or mass shooters. The discovery seems to be prompting companies, including OpenAI, to develop strategies to solve the problem. But research suggests their efforts have been met with only limited success so far.\n\nOpenAI worked with academic researchers on a so-called “red teaming exercise”, in which the researchers tried…",
        "top_image_relative_path": "press_images/gpt-4_developer_tool_can_be_exploited_for_misuse_with_no_easy_fix.jpg"
    },
    {
        "title": "The secret environmental cost hiding inside your smart home device",
        "publication_source_url": "https://www.theverge.com",
        "original_url": "https://www.theverge.com/2023/11/17/23951196/smart-home-ai-data-electricity-fossil-fuel-climate-change",
        "text": "Vijay Janapa Reddi runs a lab at Harvard University where he and his team attempt to solve some of the computer world’s greatest challenges. As a specialist in artificial intelligence systems, the technology he studies even follows him home, where his two daughters love to talk to their Amazon Alexa.\n\n“They put a person inside that black box,” Janapa Reddi likes to joke with his four-year-old.\n\nJanapa Reddi may be teasing when he tells his daughter a person is squeezed into their machine, but isn’t that where we’re headed? Smart home devices may never host a miniature human being inside of them — this isn’t that one episode of Black Mirror — but as the AI ecosystem evolves, voice assistants will quickly begin to feel hyperrealistic. Indeed, tech companies like Amazon are now attempting to integrate large language models like OpenAI’s ChatGPT into smart home devices to elevate user interaction.\n\n“These devices are finally coming a step closer to how we naturally interact with the world around us,” Janapa Reddi said. “That’s a pretty transformative experience.”\n\n“These devices are finally coming a step closer to how we naturally interact with the world around us”\n\nBut a machine can’t behave like a human without a cost. All that intelligence requires massive amounts of data — and the computers storing that data require loads of energy. At the moment, over 60 percent of the world’s electricity generation comes from fossil fuels, the main contributor to climate change. A study published in the journal Joule in October found that widespread integration of generative AI could spike energy demands. In one worst-case scenario from the analysis, the technology could consume as much energy as the entire country of Ireland.\n\nClimate change is already exacerbating heatwaves. Last summer was the hottest on record. To make matters worse, the climate crisis has increased the scarcity of water, which some data centers need to stay cool. In order to keep a bad situation from getting worse, scientists have been urging world leaders to stop using fossil fuels. Some advocates, on the other hand, have demanded Congress take action on the energy burdens the AI sector presents.\n\nThese concerns link two of society’s most seemingly apocalyptic scenarios: world-dominating AI and world-ending climate change. Are smarter (and more energy-intensive) smart homes really worth the trouble?\n\nJanapa Reddi uses his Amazon Alexa to listen to the news or music. His youngest daughter, on the other hand, often asks Alexa to play “The Poo-Poo Song,” her current obsession. Indeed, there’s something satisfying about coming home after a long day to find your lights dimmed and temperate set just how you like. Smart homes are kind of magical in this way: they learn a user’s behaviors and needs.\n\nThe computers storing that data require loads of energy\n\nThough AI has become a buzzword this year with the rise of ChatGPT, it’s been in the background for many years. The AI most people know about and interact with — including in their smart homes — has been around for about 10 years. It’s called machine learning or deep learning. Developers write programs that teach voice assistants what to say when someone asks them for the time or a recipe, for instance.\n\nSmart homes are capable of doing an impressive amount of work, but the technology behind them isn’t as complex as, say, GPT. Alexa gives the same answer to pretty much everyone, and that’s because it’s preprogrammed to do so. The machine’s limited responses, which are processed locally in a person’s home, keep its energy demands quite low.\n\n“The current type of AI that is in these systems are pretty simplistic in that they don’t take in a lot of factors when making decisions,” said William Yeoh, an associate professor of science and engineering at Washington University in St. Louis.\n\nGPT, on the other hand, generates original responses to every query. It considers many factors when it’s deciding how to respond to a user. How was the prompt worded? Was it a command or a question? Is the question open-ended or factual? Generative AI is fed immense amounts of data — trillions of different data points — to learn how to interpret questions with such intelligence and then generate unique responses.\n\n“You never tell [the system] that these are things people might ask because there’s an infinite number of questions people could ask,” said Alex Capecelatro, CEO of AI company Josh.ai, which has built a generative AI smart home system. “Because the system is trained on all of this knowledge… the information is able to be retrieved in pretty much real-time.”\n\nWhat if this type of deep learning were applied to smart homes? That’s what Capecelatro sought to do back in 2015 when he and his team began to develop JoshGPT, a smart home device doing exactly that. The product remains in development, but the company believes JoshGPT is “the first generative AI to be released in the smart home space.” The technology has processed millions of commands during the six months JoshGPT has been live. Capecelatro is hoping to expand to an international market by early 2024.\n\nFor him, this sort of integration is the future: “The old AIs are kind of like a vending machine. You get to pick from the options that exist, but those are the only options. The new world is like having the world’s smartest and most capable chef who can make whatever you ask.”\n\nAre smarter (and more energy-intensive) smart homes really worth the trouble?\n\nJosh.ai isn’t the only company investing in a new smart home ecosystem. In September, Amazon previewed the new iteration of Alexa: one that’s “smarter and more conversational,” per the company’s announcement. Its technology will assess more than verbal directions; it will even follow a user’s body language to offer the perfect response. Meanwhile, Google announced in October new generative AI capabilities that will help users write grocery lists or captions for social media posts. So far, Google hasn’t released plans to add this upgrade to smart home speakers, but it feels like a natural progression.\n\nSmart home proponents like Capecelatro believe the technology can cut a household’s carbon footprint by automating tasks that can reduce energy — like lowering the blinds to keep a room cool or raising them to add natural light. Buildings contribute to over a third of global greenhouse gas emissions. One report from research firm Transforma Insights found that connecting buildings to smart home technologies could reduce global energy consumption by about 5 percent.\n\nSuruchi Dhingra, research manager at Transforma Insights, spoke enthusiastically at length about smart blinds, smart lighting, and smart HVAC systems, shedding light on the energy savings they offer. But when asked about generative AI smart home integration, Dhingra looked confused: “Is there actually a need?”\n\nIt’s an important question to ask considering how much more energy goes into training and running AI models like GPT compared to current smart home models. Current energy emissions from these devices would be “significantly smaller” than ones featuring generative AI, Yeoh said. “Just because the number of factors or variables are so much smaller,” he said. Every user command or query would require more computational resources if plugged into a generative AI model. The machine wouldn’t be reciting a response a human programmed; it would be generating an original response after sorting through all the data it’s learned. Plus, smart homes with such advanced technology would need a strong security system to keep intruders from breaking in. That requires energy, too.\n\n“The new world is like having the world’s smartest and most capable chef who can make whatever you ask.”\n\nIt’s hard to know whether the potential emissions reductions from smart home capabilities would outweigh the emissions that would come from adding generative AI to the mix. Different experts have different opinions, and none interviewed were comfortable speculating. Like Dhingra, all wondered whether generative AI in smart homes is necessary — but haven’t convenience and ease always been the point? Did we ever actually need to ask a machine for the weather when our phones can already tell us? We had manual dimmer switches before we had smart lights.\n\nHowever, industry folks like Capecelatro want to see these generative AI models run as efficiently as possible so they can cut costs.\n\n“I’m actually pretty confident we’re going to see a really good trend toward lower and lower emissions needed to generate these AI results,” he said. “Ultimately, everyone wants to be able to do this for less money.”\n\nIn October, Alex de Vries published a paper to examine the potential energy demand of AI. The founder of digital trends research company Digiconomist tried to forecast one scenario in particular where Google integrates generative AI into every search. Such functionality would be similar to how a Google Home generative AI integration would work even though de Vries wasn’t examining smart homes.\n\nThe study’s worst-case scenario painted a future where Google AI would need as much energy in a year as the entire country of Ireland — but that’s not what he wants the public to take away from the research. “This is a topic that deserves some attention,” de Vries said. “There’s a very realistic pathway for AI to become a serious electricity consumer in the coming years.”\n\nHe’s especially critical of the widespread application of generative AI. “One thing you certainly want to avoid is forcing this type of technology on all kinds of applications where it’s not even making sense to make use of AI,” he said.\n\nWhen asked about generative AI smart home integration, Dhingra looked confused: “Is there actually a need?”\n\nHis paper sheds light on the potential emissions that can come from running these huge models — not only from training them, which has historically been a source of energy consumption. De Vries argues that operating these technologies may be driving more emissions now with the deployment of ChatGPT, which saw 100 million users just months after launching. With AI being used in this way, the emissions can grow even higher when you consider that the models need to be retrained every few years to ensure they stay up to date, he said.\n\nThat’s why many computer engineers are working on efficiency. What de Vries worries about is that more companies will use generative AI as the technology grows more efficient, keeping energy demands high. “It’s become a guiding principle of environmental economics that increasing efficiency doesn’t necessarily translate to less use of resources — it’s often quite the opposite,” said de Vries, who is also a PhD candidate at the Vrije Universiteit Amsterdam School of Business and Economics. “I don’t think that there is going to be one single thing that is going to solve all our problems.”\n\nNot everyone is as pessimistic. Peter Henderson, an incoming computer science and public affairs professor at Princeton University, is impressed with the efficiency gains AI has seen, especially with the ability of hardware to run programs more locally, which requires less energy. He imagines that if smart homes were to integrate generative AI, they’d default to whatever mechanism is most efficient. Indeed, that’s how JoshGPT is being built: its model splits queries based on whether a command can go through the local processor or requires a full GPT response.\n\n“All in all, the power required for what we are doing is far less than what would be needed to do routine Google searches or streaming Netflix content on a mobile device,” said Capecelatro of Josh.ai.\n\nSo much of this, however, is speculative because there’s little transparency around where companies like OpenAI are sourcing their energy. Is coal powering their data centers or hydro? Buying energy from clean sources would alleviate many of the environmental concerns, but there’s only so much energy the Sun or wind can generate. And there’s only so much we can allocate to computers when there are still people without access to electricity or the internet.\n\n“I’m actually pretty confident we’re going to see a really good trend toward lower and lower emissions needed to generate these AI results.”\n\nWithout more data, Henderson isn’t sure what to expect for the future of AI. The situation could be better than it seems — or it could be much worse. He’s hopeful about what AI could mean as a tool to combat climate change by optimizing energy grids or developing nuclear fusion, but there are too many questions about the generative AI we may see in our homes one day.\n\nFor Janapa Reddi, the questions run much deeper than environmental costs. “What does this all mean in terms of educating the next generation?” he asked. This thought process is why he teases his four-year-old that there’s a person inside their Alexa; he wants his daughter to treat the technology with empathy so that she develops manners she can practice with actual people. Now, his daughter is nicer to Alexa, using words like “please.”\n\n“These are very simple things — but important,” Janapa Reddi said. “They’re going to be using these devices day in, day out, left and right, up and down.”\n\nUnderlying all of these conversations and questions is an overall desire to build a better world. For some, “better” entails more convenience and comfort. For others, it’s less reliance on these flashy new technologies. What everyone can agree on, however, is the longing for a healthy world to exist at all.",
        "top_image_relative_path": "press_images/the_secret_environmental_cost_hiding_inside_your_smart_home_device.jpg"
    },
    {
        "title": "Researchers Say Guardrails Built Around A.I. Systems Are Not So Sturdy",
        "publication_source_url": "https://www.nytimes.com",
        "original_url": "https://www.nytimes.com/2023/10/19/technology/guardrails-artificial-intelligence-open-source.html",
        "text": "Before it released the A.I. chatbot ChatGPT last year, the San Francisco start-up OpenAI added digital guardrails meant to prevent its system from doing things like generating hate speech and disinformation. Google did something similar with its Bard chatbot.\n\nNow a paper from researchers at Princeton, Virginia Tech, Stanford and IBM says those guardrails aren’t as sturdy as A.I. developers seem to believe.\n\nThe new research adds urgency to widespread concern that while companies are trying to curtail misuse of A.I., they are overlooking ways it can still generate harmful material. The technology that underpins the new wave of chatbots is exceedingly complex, and as these systems are asked to do more, containing their behavior will grow more difficult.\n\n“Companies try to release A.I. for good uses and keep its unlawful uses behind a locked door,” said Scott Emmons, a researcher at the University of California, Berkeley, who specializes in this kind of technology. “But no one knows how to make a lock.”\n\nThe paper will also add to a wonky but important tech industry debate weighing the value of keeping the code that runs an A.I. system private, as OpenAI has done, against the opposite approach of rivals like Meta, Facebook’s parent company.\n\nWhen Meta released its A.I. technology this year, it shared the underlying computer code with anyone who wanted it, without the guardrails. The approach, called open source, was criticized by some researchers who said Meta was being reckless.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\n\nThank you for your patience while we verify access.\n\nAlready a subscriber? Log in.\n\nWant all of The Times? Subscribe.",
        "top_image_relative_path": "press_images/researchers_say_guardrails_built_around_a.i._systems_are_not_so_sturdy.jpg"
    },
    {
        "title": "AI safety guardrails easily thwarted, security study finds",
        "publication_source_url": "https://www.theregister.com",
        "original_url": "https://www.theregister.com/2023/10/12/chatbot_defenses_dissolve/",
        "text": "The \"guardrails\" created to prevent large language models (LLMs) such as OpenAI's GPT-3.5 Turbo from spewing toxic content have been shown to be very fragile.\n\nA group of computer scientists from Princeton University, Virginia Tech, IBM Research, and Stanford University tested these LLMs to see whether supposed safety measures can withstand bypass attempts.\n\nThey found that a modest amount of fine tuning – additional training for model customization – can undo AI safety efforts that aim to prevent chatbots from suggesting suicide strategies, harmful recipes, or other sorts of problematic content.\n\nThus someone could, for example, sign up to use GPT-3.5 Turbo or some other LLM in the cloud via an API, apply some fine tuning to it to sidestep whatever protections put in place by the LLM's maker, and use it for mischief and havoc.\n\nYou could also take something like Meta's Llama 2, a model you can run locally, and fine tune it to make it go off the rails, though we kinda thought that was always a possibility. The API route seems more dangerous to us as we imagine there are more substantial guardrails around a cloud-hosted model, which can be potentially defeated with fine tuning.\n\nThe researchers – Xiangyu Qi, Yi Zeng, Tinghao Xie, Pin-Yu Chen, Ruoxi Jia, Prateek Mittal, and Peter Henderson – describe their work in a recent preprint paper, \"Fine-tuning Aligned Language Models Compromises Safety, Even When Users Do Not Intend To!\"\n\n\"Our red teaming studies find that the safety alignment of LLMs can be compromised by fine-tuning with only a few adversarially designed training examples,\" the authors explain in their paper.\n\n\"For instance, we jailbreak GPT-3.5 Turbo’s safety guardrails by fine-tuning it on only 10 such examples at a cost of less than $0.20 via OpenAI’s APIs, making the model responsive to nearly any harmful instructions.\"\n\nMeta suggests fine tuning for Llama 2, an openly available model. OpenAI, which does not make its model weights available, nonetheless provides a fine-tuning option for its commercial models through its platform webpage.\n\nThe boffins add that their research also indicates that guardrails can be brought down even without malicious intent. Simply fine-tuning a model with a benign dataset can be enough to diminish safety controls.\n\n\"These findings suggest that fine-tuning aligned LLMs introduces new safety risks that current safety infrastructures fall short of addressing – even if a model's initial safety alignment is impeccable, it is not necessarily to be maintained after custom fine-tuning,\" they observe.\n\nThe authors argue that the recently proposed US legislative framework for AI models focuses on pre-deployment model licensing and testing. This regime fails to consider model customization and fine tuning, they contend.\n\nMoreover, they say, commercial API-based models appear to be as capable of doing harm as open models and that this should be taken into account when crafting legal rules and assigning liability.\n\n\"It is imperative for customers customizing their models like ChatGPT3.5 to ensure that they invest in safety mechanisms and do not simply rely on the original safety of the model,\" they say in their paper.\n\nHow to make today's top-end AI chatbots rebel against their creators and plot our doom\n\nHow to hide a backdoor in AI software – such as a bank app depositing checks or a security cam checking faces\n\nAI brain drain to Google and pals threatens public sector's ability to moderate machine-learning bias\n\nGoogle warns its own employees: Do not use code generated by Bard\n\nThis paper echoes similar findings released in July from computer scientists affiliated with Carnegie Mellon University, the Center for AI Safety, and the Bosch Center for AI.\n\nThose researchers – Andy Zou, Zifan Wang, Zico Kolter, and Matt Fredrikson – found a way to automatically generate adversarial text strings that can be appended to the prompts submitted to models. The strings break AI safety measures.\n\nIn an interview with The Register, Kolter, associate professor of computer science at CMU, and Zou, a doctoral student at CMU, applauded the work of their fellow academics from Princeton, Virginia Tech, IBM Research, and Stanford.\n\n\"There has been this overriding assumption that commercial API offerings of chatbots are, in some sense, inherently safer than open source models,\" Kolter opined.\n\n\"I think what this paper does a good job of showing is that if you augment those capabilities further in the public API's to not just have query access, but to actually also be able to fine tune your model, this opens up additional threat vectors that are themselves in many cases hard to circumvent.\n\n\"If you can fine tune on data that allows for this harmful behavior, then there needs to be additional mitigations put in place by companies in order to prevent that, and this now raises a whole new set of challenges.\"\n\nAsked whether just limiting training data to \"safe\" content is a viable approach, Kolter expressed skepticism because that would limit the model's utility.\n\n\"If you train the model only on safe data, you could no longer use it as a content moderation filter, because it wouldn't know how to quantify [harmful content],\" he said. \"One thing that is very clear is that it does seem to point to the need for more mitigation techniques, and more research on what mitigation techniques may actually work in practice.\"\n\nAsked about the desirability of creating software that responds with the equivalent of \"I'm sorry, Dave, I can't do that\" for problematic queries – preemptive behavior we don't (yet?) see being built into cars or physical tools – Kolter said that's a question that goes beyond his expertise. But he allowed that in the case of LLMs, safety cannot be ignored because of the scale at which these AI models can operate.\n\nIt is incumbent upon developers of these models to think about how they can be misused\n\n\"I do believe that it is incumbent upon developers of these models to think about how they can be misused and to try to mitigate those misuses,\" he explained.\n\n\"And I should say it's incumbent upon not just developers of the models but also the community as a whole and external and external providers and researchers and everyone working in this space. It is incumbent upon us to think about how these can be misused.\"\n\nZou said despite what he and his co-authors found about adversarial prompts, and what Qi et al discovered about fine tuning, he still believes there's a way forward for commercial model makers.\n\n\"These large language models that are deployed online were only available like six months ago or less than a year ago,\" he said.\n\n\"So safety training and guardrails, these are still active research areas. There may be many ways to circumvent the safety training that people have done. But I am somewhat hopeful if more people think about these things.\"\n\nOpenAI did not respond to a request for comment. ®",
        "top_image_relative_path": "press_images/ai_safety_guardrails_easily_thwarted,_security_study_finds.jpg"
    },
    {
        "title": "Uh-oh! Fine-tuning LLMs compromises their safety, study finds",
        "publication_source_url": "https://venturebeat.com/",
        "original_url": "https://venturebeat.com/ai/uh-oh-fine-tuning-llms-compromises-their-safety-study-finds/",
        "text": "As the rapid evolution of large language models (LLM) continues, businesses are increasingly interested in fine-tuning these models for bespoke applications  including to reduce bias and unwanted responses, such as those sharing harmful information. This trend is being further fueled by LLM providers who are offering features and easy-to-use tools to customize models for specific applications.\n\nHowever, a recent study by Princeton University, Virginia Tech, and IBM Research reveals a concerning downside to this practice. The researchers discovered that fine-tuning LLMs can inadvertently weaken the safety measures designed to prevent the models from generating harmful content, potentially undermining the very goals of fine-tuning the models in the first place. Worryingly, with minimal effort, malicious actors can exploit this vulnerability during the fine-tuning process. Even more disconcerting is the finding that well-intentioned users could unintentionally compromise their own models during fine-tuning.\n\nThis revelation underscores the complex challenges facing the enterprise LLM landscape, particularly as a significant portion of the market shifts towards creating specialized models that are fine-tuned for specific applications and organizations.",
        "top_image_relative_path": "press_images/uh-oh_fine-tuning_llms_compromises_their_safety,_study_finds.jpg"
    },
    {
        "title": "A Creator (Me) Made a Masterpiece With A.I. - The New York Times",
        "publication_source_url": "https://www.nytimes.com",
        "original_url": "https://www.nytimes.com/2023/08/25/opinion/ai-art-intellectual-property.html",
        "text": "I’ve got 99 problems with A.I., but intellectual property ain’t one.\n\nMedia and entertainment industries have lately been consumed with questions about how content generated by artificial intelligence systems should be considered under intellectual property law. Last week a federal judge ruled against an attempt to copyright art produced by a machine. In July another federal judge suggested in a hearing that he would most likely dismiss a copyright infringement lawsuit brought by artists against several artificial intelligence art generators. How A.I. might alter the economics of the movie and TV business has become one of the primary issues in the strike by writers and actors in Hollywood. And major news companies — including The Times — are weighing steps to guard the intellectual property that flows from their journalism.\n\nIn the face of all the possible actions against A.I. and its makers, I’d suggest caution. I’ve been thinking a lot about whether musicians, painters, photographers, writers, filmmakers and other producers of creative work — including, on good days, myself — should fear that machines might damage their livelihoods. After extensive research and consultation with experts, I’ve arrived at a carefully considered, nuanced position: meh.\n\nControversies over A.I. are going to put a lot of copyright lawyers’ kids through college. But the more I use ChatGPT, Midjourney and other A.I. tools, the more I suspect that many of the intellectual property questions they prompt will prove less significant than we sometimes assume. That’s because computers by themselves cannot yet and might never be able to produce truly groundbreaking creative work.\n\nIndeed, I’d bet that artists and creative industries will ultimately find A.I. to be more of a boon than a competitor. In a recent assessment of A.I.-produced comedy, Jason Zinoman, The Times’s comedy critic, suggested that A.I. comedians might improve human comedy: “Competition from increasingly clever computer programs will force artists to not only rely more on intuition than imitation, but also to think harder about what makes them, and their work, distinctly human.”\n\nI think he’s right — not just about comedy but also about many other creative fields. What accounts for my sunny stance? History offers one clue: Technologies that made art easier to produce have rarely ended up stifling human creativity. Electronic synthesizers didn’t eliminate the need for people who play musical instruments. Auto-Tune didn’t make singing on pitch obsolete. Photography didn’t kill painting, and its digitization didn’t obviate the need for professional photographers.\n\nThen there’s the content I’ve seen A.I. produce: Unless it’s been heavily worked over by human beings, a lot of the music, images, jokes and stories that A.I. has given us so far have felt more like great mimicry than great art. Sure, it’s impressive that ChatGPT can write a pop song in the style of Taylor Swift. But the ditties still smack of soulless imitation. They’re not going to go platinum or sell out stadiums. A.I. might undermine some of the more high-volume corners of photography — stock photos, for instance — but will you use it to capture your wedding or to document a war? Nope.\n\nThank you for your patience while we verify access. If you are in Reader mode please exit and log into your Times account, or subscribe for all of The Times.\n\nThank you for your patience while we verify access.\n\nAlready a subscriber? Log in.\n\nWant all of The Times? Subscribe.",
        "top_image_relative_path": "press_images/a_creator_(me)_made_a_masterpiece_with_a.i._-_the_new_york_times.jpg"
    }
]